# # для виконанання цього завдання я вирішив використати
# модуль itertools, а саме функцію itertools.product - аналог вкладених циклів, вона приймає як аргументи те,
# що ми ітеруємо (*iterables), а також (опційно) кількість повторень (repeat)

import itertools


def dots(text: str):
    if len(text) < 1:
        return []
    for i in itertools.product(['', '.'], repeat=len(text) - 1):
        result = text[0]
        for k, v in zip(i, text[1:]):
            result += k + v

        # замість звичайної функції використано функцію-генератор,
        # яка при кожній ітерації в циклі for повертає наступне значення.
        yield result


# на виході отримуємо спеціальний обєкт - генератор, який можна перетворити в список за допомогою вбудованої функції
# list

if __name__ == "__main__":
    print(list(dots('abcd')))

# результат роботи функції перевіряв за допомогою юніт-тестування (файл TestDots.py),
# для цього прописав кілька кейсів (input_values) та очікувані значення (expected_values)
